{
  "HomeView": [
    {
      "content": "Über mich",
      "index": 0,
      "type": "heading"
    },
    {
      "content": "Mein Name ist Michael Angerer und ich bin 20 Jahre alt. Ich komme aus Julbach im südöstlichen Niederbayern, an der Grenze zu Österreich, wo Inn und Salzach zusammenfließen. Derzeit bin ich dualer Student in Ingolstadt und studiere Informatik, bin allerdings sowohl für Unterricht als auch Arbeit derzeit zuhause. Wegen der Gründe, die ich bereits im Bewerbungsschreiben angegeben habe, möchte ich mich bei Ihnen bewerben.",
      "index": 1,
      "type": "prose"
    },
    {
      "content": "Meine Bindung zu Computern besteht schon von klein auf. Seit ich denken kann, hatten wir einen PC daheim stehen, an dem ich auch oft mit meinem Bruder zusammen gespielt oder ihm zugeschaut habe. Diese Bindung hat sich dann noch verstärkt, als ich mit ~10 Jahren erstmals Zugang zum Internet hatte. Die Kombination aus Video-Streams, Videospielen und genereller Internet- und Forenkultur prägt und interessiert mich auch noch bis zum heutigen Tag",
      "index": 2,
      "type": "prose"
    },
    {
      "content": "Programmieren selbst war mir auch schon immer im Hinterkopf, wenn ich es auch nie wirklich als Hobby angesehen habe. Mir war schlicht und ergreifend die Einstiegsbarriere zu groß, vor allem ohne wirklichen 'Startpunkt' oder 'Lehrer' und einer unüberblickbaren Masse an Information im Internet. Deswegen hat auch der Informatik-Unterricht am Gymnasium mein Interesse in diese Richtung erstmals geweckt, auch wenn wir damals eher theoretisches Wissen vermittelt bekommen haben. Erst im Studium selbst habe ich durch die Praktika und Praxisphasen im Betrieb sowohl eine Umgebung von erfahrenen Programmierern, als auch einen graduellen aber tiefgreifenden und umfassenden Einstieg in die Informatik erleben dürfen.",
      "index": 3,
      "type": "prose"
    },
    {
      "content": "Was mir am Programmieren am meisten gefällt, ist:",
      "index": 4,
      "type": "prose"
    },
    {
      "content": "Die spielerische Puzzle-artigkeit des Codes. Man kann Code an allen Ecken und Enden verbessern um ihn schneller, leistungsfähiger, einfacher, lesbarer, etc. zu machen. Einen sauber strukturierten und möglichst simplen Code zu erreichen, der aber trotzdem modular benutzbar ist, ist eine Herausforderung, die eigentlich immer nach oben offen ist und immer motiviert, noch irgendwo anders zu schrauben.",
      "index": 5,
      "type": "prose"
    },
    {
      "content": "Dass stets etwas neues zu lernen ist. Coding ist eigentlich vom Fähigkeits-Anspruch immer nach oben offen. Man kann zwar heutzutage libraries von überall anders einbinden und sich so die Arbeit leichter machen, um aber genau die Funktionalität zu erreichen, die man haben will, ist es oft effizienter, diese selbst zu bauen. Dieses Prinzip zieht sich dann von Frameworks über Sprachen bis hin zu Betriebssystemen. Es gibt also immer etwas zu lernen, wodurch man seinen Code noch effizienter gestalten kann.",
      "index": 6,
      "type": "prose"
    },
    {
      "content": "Die Open-Source-Mentalität. Als (manchmal zu) sparsamer Mensch gefällt mir das Prinzip von Open-Source und generell der Offenheit, die im Bereich Engineering herrscht sehr. In Zeiten, in denen bestehende Urheberrechts-Strukturen trotz globaler Vernetzung auch im Internet durchgesetzt werden sollen, ist Open-Source eine erfrischende Denkweise.",
      "index": 7,
      "type": "prose"
    },
    {
      "content": "\"Man muss nicht alles wissen. Man muss nur wissen, wo man nachschauen kann\"",
      "index": 8,
      "type": "quote"
    }
  ],
  "AcademicsView": [
    {
      "content": "This is an AcademicsViewComponent",
      "index": 0,
      "type": "prose"
    },
    {
      "content": "Tab #1",
      "index": 1,
      "type": "title"
    },
    {
      "content": "Lacus sed viverra tellus in hac habitasse platea dictumst. Dui sapien eget mi proin sed. Lorem mollis aliquam ut porttitor leo a diam sollicitudin. Neque viverra justo nec ultrices. Dis parturient montes nascetur ridiculus mus mauris vitae ultricies. Scelerisque eu ultrices vitae auctor eu augue ut. Rhoncus est pellentesque elit ullamcorper. Bibendum neque egestas congue quisque egestas diam in arcu cursus. Tortor at auctor urna nunc id cursus metus aliquam eleifend. Et netus et malesuada fames ac turpis.",
      "index": 2,
      "type": "prose"
    },
    {
      "content": "The other tab",
      "index": 3,
      "type": "title"
    }
  ],
  "ProjectsView": []
}
